tap "ankitpokhrel/jira-cli"
tap "fxstein/fxstein"
tap "gemfury/tap"
tap "getsentry/tools"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "menubar-apps/menubar-apps"
tap "ngrok/ngrok"
tap "pkgxdev/made"
tap "redis-stack/redis-stack"
tap "sidneys/homebrew"
tap "snyk/tap"
# Run your GitHub Actions locally
brew "act"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# TIFF library and utilities
brew "libtiff"
# Arduino command-line interface
brew "arduino-cli"
# Download with resuming and segmented downloading
brew "aria2"
# ChatGPT in the terminal
brew "ata"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Terminal bandwidth utilization tool
brew "bandwhich"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2@1.7"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Collection of portable C++ source libraries
brew "boost"
# Extract files from Microsoft cabinet files
brew "cabextract"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Platform built on V8 to build network applications
brew "node"
# Contentful command-line tools
brew "contentful-cli"
# GNU File, Shell, and Text utilities
brew "coreutils"
# GNU data recovery tool
brew "ddrescue"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Text processing system for reStructuredText
brew "docutils"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Framework for layout and rendering of i18n text
brew "pango"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# TUI Git client inspired by Magit
brew "gitu"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Network related modules for glib
brew "glib-networking"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Library to render SVG files using Cairo
brew "librsvg"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# HTTP client/server library for GNOME
brew "libsoup"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Development framework for multimedia applications
brew "gstreamer"
# Website copier/offline browser
brew "httrack"
# Command-line benchmarking tool
brew "hyperfine"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Simple terminal UI for git commands
brew "lazygit"
# Library and tools for dealing with GeoTIFF
brew "libgeotiff"
# Implementation of the file(1) command
brew "libmagic"
# Library for complex text layout
brew "libraqm"
# Library for USB device access
brew "libusb"
# GNOME XML library
brew "libxml2"
# Quickly generate a temporary email address
brew "mailsy"
# High performance, distributed memory object caching system
brew "memcached", restart_service: true
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Open source relational database management system
brew "mysql@5.7", link: true
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node@16"
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# Information gathering framework for phone numbers
brew "phoneinfoga"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@14"
# Modern replacement for ps written in Rust
brew "procs"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Cross-platform application and UI framework
brew "qt"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Zsh prompt for Astronauts
brew "spaceship"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Powerful free data recovery utility
brew "testdisk"
# Highly available Prometheus setup with long term storage capabilities
brew "thanos"
# Framework for scalable cross-language services development
brew "thrift"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Feature-rich interactive Jira command-line
brew "ankitpokhrel/jira-cli/jira-cli"
# Missing GoPro workflow manager for zsh
brew "fxstein/fxstein/goprox"
# CLI For Gemfury Package Repository
brew "gemfury/tap/fury-cli"
# Sentry command-line client for some generic tasks
brew "getsentry/tools/sentry-cli"
# Terraform
brew "hashicorp/tap/terraform"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# Run Anything
brew "pkgxdev/made/pkgx"
# Offline NT Password Editor
brew "sidneys/homebrew/chntpw"
# Find & fix known vulnerabilities in open-source dependencies
brew "snyk/tap/snyk"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application uninstaller
cask "appcleaner"
# Electronics prototyping platform
cask "arduino"
# Two-factor authentication software
cask "authy"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Display management tool
cask "betterdisplay"
# Web browser focusing on privacy
cask "brave-browser"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Use your phone as a high-quality webcam with image tuning controls
cask "camo-studio"
# Web debugging Proxy application
cask "charles"
# Free and open-source web browser
cask "chromium"
# Hardware benchmarking utility
cask "cinebench"
# Voice and text chat software
cask "discord"
# Data recovery software
cask "disk-drill"
# Application window manager focusing on simplicity
cask "divvy"
# Tool to hide status bar icons
cask "dozer"
# Online diagram software
cask "drawio"
# Reimagine your terminal
cask "fig"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-3270-nerd-font"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-jetbrains-mono"
# Desktop client for GitHub repositories
cask "github"
# GitHub notifications on your menu bar
cask "gitify"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Light, Electron-based Wrapper around GraphiQL
cask "graphiql"
# IDE for exploring GraphQL APIs
cask "graphql-ide"
# GraphQL IDE for better development workflows
cask "graphql-playground"
# HTTP and GraphQL Client
cask "insomnia"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Free and Open Source Video Editor
cask "kdenlive"
# Desktop shield and keystroke interceptor
cask "keyboard-cleaner"
# Adaptive brightness for external displays
cask "lunar"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Remote desktop client
cask "microsoft-remote-desktop"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Silence embarrassing notifications while screensharing
cask "muzzle"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Open-source software for live streaming and screen recording
cask "obs"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Replacement for Docker Desktop
cask "orbstack"
# Home media player
cask "plex"
# OpenVPN client
cask "pritunl"
# GitHub pull requests in you menu bar
cask "pullbar"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Redis server with additional database capabilities and the visualisation tool RedisInsight.
cask "redis-stack"
# A graphical tool for visualizing data and managing Redis databases
cask "redis-stack-redisinsight"
# Redis Stack Server install a Redis server with additional database capabilities
cask "redis-stack-server"
# Modified browser that helps in responsive web development
cask "responsively"
# Emoji picker optimised for blind people
cask "rocket"
# Music player
cask "roon"
# Ruby on Rails IDE
cask "rubymine"
# JavaScript playground that auto-evaluates as code is typed
cask "runjs"
# Video chat, voice call and instant messaging application
cask "skype"
# Graphical client for Git version control
cask "sourcetree"
# Music streaming service
cask "spotify"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# Music streaming service with high fidelity sound and hi-def video quality
cask "tidal"
# No BS todo menubar app!
cask "todobar"
# Menu bar pomodoro timer
cask "tomatobar"
# Open-source code editor
cask "visual-studio-code"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
vscode "aaravb.chrome-extension-developer-tools"
vscode "ahmadalli.vscode-nginx-conf"
vscode "albertorestifo.gitlab-webide-theme"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "antyos.openscad"
vscode "ayushh.vscode-anchor"
vscode "betajob.modulestf"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "caarlos0.language-prometheus"
vscode "codemos.codemos-modern"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "eliverlara.andromeda"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "eseom.nunjucks-template"
vscode "esphome.esphome-vscode"
vscode "evilz.vscode-reveal"
vscode "fabiospampinato.vscode-open-in-github"
vscode "firsttris.vscode-jest-runner"
vscode "folke.vscode-monorepo-workspace"
vscode "formulahendry.code-runner"
vscode "formulahendry.docker-explorer"
vscode "formulahendry.github-actions"
vscode "fowlow.gradianto-deep-ocean"
vscode "george3447.docker-run"
vscode "gerane.theme-dracula"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "groksrc.ruby"
vscode "hangxingliu.vscode-nginx-conf-hint"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.debug-visualizer"
vscode "hediet.vscode-drawio"
vscode "hoovercj.ruby-linter"
vscode "hridoy.rails-snippets"
vscode "itarato.byesig"
vscode "jakob101.relativepath"
vscode "jasonnutter.github-pr"
vscode "johnpapa.vscode-peacock"
vscode "kaiwood.endwise"
vscode "karunamurti.haml"
vscode "kodezi.kodezi"
vscode "koichisasada.vscode-rdbg"
vscode "leathong.openscad-language-support"
vscode "maattdd.gitless"
vscode "matheusq94.tfs"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "michaelzhou.fleet-theme"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "nrwl.angular-console"
vscode "orta.vscode-jest"
vscode "oscarback.actions-to-graph"
vscode "parallel-universe.gpt-copilot"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "raynigon.nginx-formatter"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "robbowen.synthwave-vscode"
vscode "samwinslow.vscode-coffeescript-haml"
vscode "sdras.inbedby7pm"
vscode "shadowtime2000.eta-vscode"
vscode "shakram02.bash-beautify"
vscode "shanoor.vscode-nginx"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "shopify.vscode-shadowenv"
vscode "shuworks.vscode-table-formatter"
vscode "simonsiefke.svg-preview"
vscode "sorbet.sorbet-vscode-extension"
vscode "stpn.vscode-graphql"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "suming.react-proptypes-generate"
vscode "syler.sass-indented"
vscode "syler.vscode-haml-formatter"
vscode "sysoev.vscode-open-in-github"
vscode "tal7aouy.icons"
vscode "thecodetherapy.thecodetheme-dark"
vscode "thibmaek.vsc-esphome-snippets"
vscode "tokiedokie.reveal-markdown"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "ventura.prom"
vscode "vespa-dev-works.jestrunit"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vstirbu.vscode-mermaid-preview"
vscode "wakatime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "wesbos.theme-cobalt2"
vscode "william-voyek.vscode-nginx"
vscode "yoavbls.pretty-ts-errors"
vscode "zainchen.json"
vscode "zhuangtongfa.material-theme"
