
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "ack"
brew "autoconf"
brew "automake"
brew "aws-console"
brew "awscli"
brew "awscli"
brew "bash"
brew "coreutils"
brew "docker-machine"
brew "docker"
brew "ffmpeg"
brew "findutils"
brew "gh"
brew "gifsicle"
brew "git"
brew "gnutls"
brew "gobject-introspection"
brew "gradle"
brew "graphviz"
brew "harfbuzz"
brew "hub"
brew "imagemagick"
brew "jq"
brew "krb5"
brew "libmemcached"
brew "lynx"
brew "markdown"
brew "mas"
brew "memcached"
brew "mercurial"
brew "micro"
brew "netlify-cli"
brew "node"
brew "nvm" 
brew "openvpn", restart_service: true
brew "pango"
brew "postgresql"
brew "pypy"
brew "python@3.8"
brew "rabbitmq"
brew "rename"
brew "ruby"
brew "ssh-copy-id"
brew "subversion"
brew "terminal-notifier"
brew "terraform"
brew "the_silver_searcher"
brew "tig"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-autosuggestions"
brew "zsh-git-prompt"
brew "zsh-syntax-highlighting"
cask "appcleaner"
cask "authy"
cask "aws-vpn-client"
cask "blender"
cask "brave-browser-dev"
cask "corretto11"
cask "docker"
cask "figma"
cask "figma"
cask "firefox"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-lato"
cask "geekbench"
cask "google-chrome"
cask "insomnia"
cask "intel-power-gadget"
cask "iterm2"
cask "logitech-options"
cask "macs-fan-control"
cask "microsoft-auto-update"
cask "microsoft-edge-dev"
cask "microsoft-edge"
cask "microsoft-teams"
cask "nomachine"
cask "obs"
cask "postgres"
cask "postico"
cask "rectangle"
cask "skype"
cask "slack"
cask "smcfancontrol"
cask "sourcetree"
cask "spotify"
cask "streamlabs-obs"
cask "sublime-merge"
cask "sublime-text"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

