tap "ankitpokhrel/jira-cli"
tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Search tool like grep, but optimized for programmers
brew "ack"
# Run your GitHub Actions locally 🚀
brew "act"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Command-line to use AWS CLI credentials to launch the AWS console in a browser
brew "aws-console"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Core application library for C
brew "glib"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Programming language for highly scalable real-time systems
brew "erlang"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Simple jira command-line client in Go
brew "go-jira"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Framework for layout and rendering of i18n text
brew "pango"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# C and C++ client library to the memcached server
brew "libmemcached"
# Text-based web browser
brew "lynx"
# Text-to-HTML conversion tool
brew "markdown"
# Mac App Store command-line interface
brew "mas"
# High performance, distributed memory object caching system
brew "memcached"
# Scalable distributed version control system
brew "mercurial"
# Modern and intuitive terminal-based text editor
brew "micro"
# HTTP and WebDAV client library with a C interface
brew "neon"
# Netlify command-line tool
brew "netlify-cli"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn", restart_service: true
# Highly capable, feature-rich programming language
brew "perl"
# Object-relational database system
brew "postgresql"
# Highly performant implementation of Python 2 in Python
brew "pypy"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Messaging broker
brew "rabbitmq", restart_service: true
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Version control system designed to be a better CVS
brew "subversion"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Tool to build, change, and version infrastructure
brew "terraform"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Informative git prompt for zsh
brew "zsh-git-prompt"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# 🔥 Feature-rich interactive Jira command-line
brew "ankitpokhrel/jira-cli/jira-cli"
# AWS SAM CLI 🐿 is a tool for local development and testing of Serverless applications
brew "aws/tap/aws-sam-cli", link: false
# Network scanner
cask "angry-ip-scanner"
# Application uninstaller
cask "appcleaner"
# Electronics prototyping platform
cask "arduino"
# Two-factor authentication software
cask "authy"
# Managed client-based VPN service to securely access AWS resources
cask "aws-vpn-client"
# Utility to create and modify archives
cask "betterzip"
# 3D creation suite
cask "blender"
# Web browser focusing on privacy
cask "brave-browser-dev"
cask "caldigit-docking-utility"
cask "caldigit-thunderbolt-charging"
# Free and open-source web browser
cask "chromium"
cask "cinebench"
# FTP File Transfer Software
cask "classicftp"
# OpenJDK distribution from Amazon
cask "corretto11"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Eclipse IDE for Java developers
cask "eclipse-java"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-fira-code"
# Typeface made for developers
cask "font-jetbrains-mono"
cask "font-lato"
# 3D parametric modeler
cask "freecad"
# Tool to measure the computer system's performance
cask "geekbench"
# Git client focusing on productivity
cask "gitkraken"
# Git interface focused on visual interaction
cask "gitup"
# HTTP and GraphQL Client
cask "insomnia"
# Power usage monitoring tool enabled for Intel Core processors
cask "intel-power-gadget"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Test automation solution
cask "katalon-studio"
# Office suite
cask "libreoffice"
# Software for Logitech devices
cask "logitech-options"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Operating system maintenance and cleaning utility
cask "maintenance"
cask "markdownmdimporter"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Multi-platform web browser
cask "microsoft-edge-dev"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Silence embarrassing notifications while screensharing
cask "muzzle"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Remote desktop software
cask "nomachine"
# Open-source software for live streaming and screen recording
cask "obs"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
cask "postgres"
# GUI client for PostgreSQL databases
cask "postico"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Emoji picker optimized for blind people
cask "rocket"
# Web browser
cask "safari-technology-preview"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Sets a minimum speed for built-in fans
cask "smcfancontrol"
# Graphical client for Git version control
cask "sourcetree"
# Music streaming service
cask "spotify"
# All-in-one live streaming software
cask "streamlabs-obs"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# Messaging app with a focus on speed and security
cask "telegram"
# QuickLook generator for Markdown files
cask "toland-qlmarkdown"
# Open-source code editor
cask "visual-studio-code"
# Code editor
cask "visual-studio-code-insiders"
# Multimedia player
cask "vlc"
# Desktop client for WhatsApp
cask "whatsapp"
mas "Apple Configurator 2", id: 1037126344
mas "GarageBand", id: 682658836
mas "Grammarly for Safari", id: 1462114288
mas "Honey", id: 1472777122
mas "Hush", id: 1544743900
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Meeter", id: 1510445899
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Refined GitHub", id: 1519867270
mas "SnailSVN Lite", id: 1063090543
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
mas "Unzip - RAR ZIP 7Z Unarchiver", id: 1537056818
mas "Webcam Settings", id: 533696630
mas "Xcode", id: 497799835
